app/controllers/scores_controller.rb

INSERT INTO "scores" ("player", "score", "time") VALUES (?, ?, ?)  [["player", "new player"], ["score", 1], ["time", "2022-11-04 13:58:28"]]
---
  def create
    @score = Score.create!(
      player: params[:player],
      score: params[:score],
      time: DateTime.iso8601(params[:time])
    )

SELECT "scores".* FROM "scores" WHERE "scores"."player" IN (?, ?) AND (time >= '2022-10-29 13:58:29') AND (time <= '2022-11-02 13:58:29') ORDER BY "scores"."score" DESC, "scores"."time" DESC LIMIT ? OFFSET ?  [["player", "A"], ["player", "B"], ["LIMIT", 20], ["OFFSET", 0]]
---
  def index
    @scores = Score.by_players(@players)
                   .after(@after)
                   .before(@before)
                   .page(@page)
                   .per(@size)
                   .order(score: :desc, time: :desc)

DELETE FROM "scores" WHERE "scores"."id" = ?  [["id", 1]]
---
  def destroy
    @score.destroy